---
kind: type
id: T:Autodesk.Revit.DB.Edge
source: html/7155ef49-fcd9-c80a-6232-70189a617bcc.htm
---
# Autodesk.Revit.DB.Edge

An edge of a 3d solid.

## Syntax (C#)
```csharp
public class Edge : GeometryObject
```

## Remarks
Edges are defined by intersections of surfaces that form faces of the solid.
They have arbitrary parameterization that is normalized to [0,1].